-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 03, 2018 at 03:04 AM
-- Server version: 10.1.28-MariaDB
-- PHP Version: 7.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `nopadol`
--

-- --------------------------------------------------------

--
-- Table structure for table `active_point`
--

CREATE TABLE `active_point` (
  `Active_id` tinyint(3) UNSIGNED ZEROFILL NOT NULL,
  `Active_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `active_point`
--

INSERT INTO `active_point` (`Active_id`, `Active_name`) VALUES
(001, 'จุดบริการลูกค้า'),
(002, 'โรงเหล็ก'),
(003, 'ห้อง IT'),
(004, 'GR'),
(005, 'GR S02'),
(006, 'Home mart');

-- --------------------------------------------------------

--
-- Table structure for table `asset`
--

CREATE TABLE `asset` (
  `Asset_id` tinyint(4) UNSIGNED ZEROFILL NOT NULL,
  `Asset_code` char(12) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_serial` char(15) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `mac_address` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `computer_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `brand` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_date` date NOT NULL,
  `Asset_company` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_price` decimal(8,2) NOT NULL,
  `Asset_barcode` char(12) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_Category` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_photo` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_time` date NOT NULL,
  `detail` varchar(250) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_status` tinyint(2) UNSIGNED ZEROFILL NOT NULL,
  `active_point` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `Asset_log` int(1) NOT NULL DEFAULT '1',
  `Asset_remand` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `asset`
--

INSERT INTO `asset` (`Asset_id`, `Asset_code`, `Asset_serial`, `Asset_name`, `mac_address`, `computer_name`, `brand`, `Asset_date`, `Asset_company`, `Asset_price`, `Asset_barcode`, `Asset_Category`, `Asset_photo`, `Asset_time`, `detail`, `Asset_status`, `active_point`, `Asset_log`, `Asset_remand`) VALUES
(0001, '5500100', 'ETP780I79ISL', 'คอมพิวเตอร์', '00-00-TH-12-88', 'DESKTOP-B6R80FA', 'Sumsung', '2017-12-11', 'JIB', '39000.00', 'OIU901273547', '002', '7B33C12011_girl.png', '2017-11-25', 'เอาใหม่ๆนะ จะได้ไหม\r\nลองเทสรูปปปป                                                                                                                                                                        ', 03, '006', 1, '2018-02-01 16:27:47'),
(0007, '5800327', 'US0023S307', 'เครื่องนำทางสู่อนาคต', '127.0.00.152', 'PANAMA', 'Susi', '2017-12-11', 'โดเรมอน', '999999.99', '123456789012', '007', '11117CA403_if_printer_289614.png', '2017-11-27', 'อุปกรณ์ที่จะทำให้คุณเดินทางไปสู่อนาคตได้\r\nเพียงแค่คุณ...หลับ', 02, '004', 1, '2018-02-02 09:09:57'),
(0002, '5500122', 'POQ780I79ISLO', 'จอ', '00-00-88-12-12', 'Jason', 'lenovo', '2017-12-11', 'บริษัทอินเกรสโอเอ(เชียงใหม่)จำกัด', '3500.00', 'OIU901273577', '001', '1B70811913_if_sign-up_49622.png', '2017-11-27', '                            ', 01, '001', 1, '2018-02-02 09:12:20'),
(0003, '35678990343', 'T3P02139485PE', 'โน๊ตบุ๊ค', '12-A0-TH-12-M7', 'TOY', 'acer', '2017-12-11', 'MMM', '26000.00', 'PP780I79ISL0', '005', '', '2017-11-27', 'ซื้อมาใช้ได้เลย', 01, '006', 1, '2018-02-02 09:10:03'),
(0004, '1249411234', 'AAA780I79ISLO', 'คอมพิวเตอร์', 'A1-SQ-89-PP-99', 'thantip', 'X1', '2017-12-11', 'บริษัท MMM', '30000.00', 'OIU901272222', '002', '851C1792BA_if_3_2694136.png', '2017-11-24', '', 03, '002', 1, '2018-02-02 09:10:06'),
(0006, '5800326', 'US00233307', 'เครื่อง Lenovo', 'none', 'none', 'Lenovo', '2017-12-11', 'กาดหลวง', '9999.00', '123456789013', '005', '51B4C5470A_if_6_2694143.png', '2017-11-24', 'ทดลองใส่เฉยๆ', 03, '001', 1, '2018-02-02 09:10:09'),
(0008, '5800145', 'ABCDEF12345', 'Barcode', '', '', 'Susi', '2017-11-01', 'กาดหลวง', '500.00', '123456789011', '006', '1A87B34014_home-128.png', '2017-11-24', '', 01, '003', 1, '2018-01-20 02:39:27'),
(0009, '0000007', 'ABCDEF12345x', 'แฮนไดร์', '127.0.00.152', 'PANAMA', 'Susi', '2017-10-31', 'กาดหลวง', '500.00', '12345678909', '006', '00111B29C7_P-1-36-128.png', '2017-11-22', 'ทดสอบการแอดลำดับที่ 9 ครั้งที่ 4', 01, '006', 1, '2017-11-28 10:00:29'),
(0010, '0000008', 'ZXCVBNM005OSLQ', 'IPhone X', '127.0.00.152', 'IPhone GEnX', 'Susi', '2017-11-20', 'กาดหลวง', '999999.99', '259876543210', '002', 'C794081312_magnifier-cheque-128.png', '2017-11-21', 'ทดสอบ Pop up                            ', 01, '001', 1, '2018-01-30 03:15:08');

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `Category_id` tinyint(3) UNSIGNED ZEROFILL NOT NULL,
  `Category_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`Category_id`, `Category_name`) VALUES
(001, 'จอ'),
(002, 'เครื่องคอมพิวเตอร์'),
(003, 'Handheld'),
(004, 'All in One'),
(005, 'Note Book'),
(007, 'Ram'),
(006, 'Flash Drive');

-- --------------------------------------------------------

--
-- Table structure for table `category_spare`
--

CREATE TABLE `category_spare` (
  `Category_id` tinyint(2) UNSIGNED ZEROFILL NOT NULL,
  `Category_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `category_spare`
--

INSERT INTO `category_spare` (`Category_id`, `Category_name`) VALUES
(01, 'เมาส์'),
(02, 'คีย์บอร์ด'),
(03, 'สายแลน');

-- --------------------------------------------------------

--
-- Table structure for table `customer`
--

CREATE TABLE `customer` (
  `CustomerID` varchar(4) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Email` varchar(50) NOT NULL,
  `CountryCode` varchar(2) NOT NULL,
  `Budget` double NOT NULL,
  `Used` double NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `customer`
--

INSERT INTO `customer` (`CustomerID`, `Name`, `Email`, `CountryCode`, `Budget`, `Used`) VALUES
('C001', 'Win Weerachai', 'win.weerachai@thaicreate.com', 'TH', 1000000, 600000),
('C002', 'John  Smith', 'john.smith@thaicreate.com', 'UK', 2000000, 800000),
('C003', 'Jame Born', 'jame.born@thaicreate.com', 'US', 3000000, 600000),
('C004', 'Chalee Angel', 'chalee.angel@thaicreate.com', 'US', 4000000, 100000),
('C005', 'Jannee', 'bigkungzana@gmail.com', 'TH', 50000, 5000),
('C006', 'BeBee', 'bigkungzana@gmail.com', 'UK', 30000, 3000),
('C007', 'Nanee', 'bigkungzana@gmail.com', 'JP', 10000, 1000),
('1', 'Jannee', 'bigkungzana@gmail.com', 'TH', 50000, 5000),
('2', 'BeBee', 'bigkungzana@gmail.com', 'UK', 30000, 3000),
('3', 'Nanee', 'bigkungzana@gmail.com', 'JP', 10000, 1000);

-- --------------------------------------------------------

--
-- Table structure for table `employee`
--

CREATE TABLE `employee` (
  `Emp_id` char(6) COLLATE utf8_unicode_ci NOT NULL,
  `Emp_code` char(5) COLLATE utf8_unicode_ci NOT NULL,
  `Emp_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `Emp_department` varchar(60) COLLATE utf8_unicode_ci NOT NULL,
  `Emp_tel` char(10) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `employee`
--

INSERT INTO `employee` (`Emp_id`, `Emp_code`, `Emp_name`, `Emp_department`, `Emp_tel`) VALUES
('N0001', 'TAI00', 'ธารทิพย์ เศรษฐกิจ', 'แผนก IT', '0946365086'),
('N0002', 'P1213', 'กฤติยา กันทารักษ์', 'แผนกบัญชี', '0383635533'),
('N0003', 'E2121', 'พี่ใจดี', 'แผนกขายโครงการ', '0383735353'),
('N0004', 'T3333', 'พี่แตงโมคนสวย', 'แผนกการเงิน', '0986535355'),
('N0005', 'YPEER', 'น้องบิ๊กเอ็ม', 'แผนก IT', '0841720778');

-- --------------------------------------------------------

--
-- Table structure for table `emp_department`
--

CREATE TABLE `emp_department` (
  `emp_id` char(6) COLLATE utf8_unicode_ci NOT NULL,
  `emp_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `emp_department`
--

INSERT INTO `emp_department` (`emp_id`, `emp_name`) VALUES
('001', 'ประเสริฐ อุ่นศิริ'),
('17001', 'สุนฮง บุญมากทรัพย์'),
('19002', 'อัมพรรณ์  อูปเงิน'),
('20002', 'เสน่ห์ วรรณเรือง'),
('20007', 'นพดล ปัญญารัตน์'),
('20012', 'วรพันธ์  วรผล'),
('20018', 'บุญเยี่ยม  เขื่อนคำ'),
('25004', 'ยุรภรณ์ วิไลวงค์'),
('26005', 'ชัยพร อ้ายเสาร์'),
('26006', 'รณรงค์   ผิวสลิด'),
('27007', 'สมศรี  โคกเอี่ยม'),
('29009', 'เจนจิรา มูลคำ'),
('30003', 'เสริฐ จันตา'),
('31011', 'บุญทิวา บุญมากทรัพย์'),
('31012', 'ชัยพร เขียวจันสืบ'),
('32014', 'พรทิพย์ ทองงาม'),
('33015', 'ณันทยา  ราชานาค'),
('33017', 'จรัสศรี  เตียวตระกูล'),
('34001', 'ฐิติพรรณ  ปัญญาดวง'),
('34022', 'กัญญณัฐ มธุระเมธานนท์'),
('35025', 'วิไลวรรณ บุญมาก'),
('35026', 'ณัฏฐ์ชยาภรณ์ รอดเครือทอง'),
('35028', 'วรามาศ   สัณฐิติเจริญวง'),
('35029', 'สมชัย ปัญญาดวง'),
('35030', 'อุทุมพร มูลมั่ง'),
('36031', 'กัญพัชร์ ประทีปสว่างวงศ์'),
('37037', 'กัญจิรา  ภูมิทอง'),
('38041', 'รติรัตน์ แสงเมือง'),
('38045', 'อำนวย ผาจันทร์แก้ว'),
('38046', 'ทัศนีย์  เตชะวัชรีกุล'),
('39048', 'สมบูรณ์ ปัญญาดี'),
('39050', 'เกษม อานนทวิลาศ'),
('40052', 'สายหยุด ต๊ะเรือน'),
('41054', 'สาธิต โฉมวัฒนา'),
('42072', 'วัชรากร แก้วดี'),
('43073', 'รักศิริ โพธ์แก้วสุกใส'),
('45040', 'สมรถ หลักฐาน'),
('45055', 'อุดม ศรีจรัญ'),
('45063', 'สิริรัญญา แว่นไว'),
('45075', 'ณัฐพิมล รมภิรัง'),
('46038', 'นิคม วงษ์เครา'),
('46095', 'ทิพวรรณ อ้ายเสาร์'),
('46098', 'อุษา สุวรรณ์'),
('46102', 'อรอนงค์ ศรปะละ'),
('46111', 'พรปวีณ์ เทพวงค์'),
('47013', 'เมตตา จันทร์ทิพย์'),
('47032', 'อธิษฐ์  รู้หาเงิน'),
('47042', 'รุ่งโรจน์ ศิริ'),
('47061', 'วชิราภรณ์ หลักฐาน'),
('47079', 'ธนันท์ อานนทวิลาศ'),
('47111', 'วิทยา สารีอินทร์'),
('47126', 'ศรัญญา  รินฤทธิ์'),
('48034', 'ประจักร์ ปันนา'),
('48070', 'กาญจนา อุดทาเรือน'),
('48077', 'จิราภรณ์ อานนทวิลาศ'),
('49024', 'นคร ศรีป้อ'),
('49050', 'ถวิล รูปละออ'),
('49112', 'นภาพรรณ  โพธิ์เนียม'),
('49120', 'ศิราภา จันทร์ฉาย'),
('49135', 'อาภากร จันทร์ฉาย'),
('50035', 'ลิขิตศักดิ์  เจริญเมือง'),
('50048', 'ทิพกัญญา ชมภูธัญ'),
('51005', 'สันติ ลือภา'),
('51016', 'ธีรเศรษฐ์ กระจ่างศรีศิลป์'),
('51067', 'สมศักดิ์ บุญเชิญ'),
('52008', 'โสภิตา มีแจ้'),
('52013', 'พีรพร จีนะ'),
('52049', 'จิรัฏฐ์ คำแจ้'),
('52050', 'อนุชา สุปัญญา'),
('52053', 'ตัว -'),
('52054', 'รำ -'),
('52075', 'เอื้อมพร ยิ่งวิริยะ'),
('52118', 'พรศักดิ์ ไทยกรณ์'),
('52121', 'ยงยุทธ ทองเทียน'),
('52122', 'นุสรา ยะกอง'),
('52127', 'นพดล มาป้อ'),
('52155', 'กิตติพงษ์ เมืองวงค์'),
('52160', 'ขจรยศ กันธา'),
('53011', 'น้ำฝน ปันนา'),
('53065', 'อังคณา ตุ่นคำ'),
('53067', 'เบญจวรรณ ทองเสาร์'),
('53068', 'วิจิตรา กันธะดส'),
('53104', 'พนัส นุตะเตมีย์'),
('53195', 'รัชดาพร กองโกย'),
('53228', 'ธีร์รัตถ์ อัมรินทร์'),
('54009', 'เจษฎาภรณ์ กันทาสุข'),
('54012', 'บุญยก ปัญญาน๊ะ'),
('54022', 'พิรุณ สามหงส์'),
('54032', 'กาญจณี เขียวคำ'),
('54036', 'พัทธวรรณ ปัญญาดี'),
('54063', 'ศิตา ใจธิตา'),
('54068', 'วลัยพร จำปา'),
('54072', 'ณฐพล เยาวเรศ'),
('54113', 'นภาพงษ์ มูลเมือง'),
('54132', 'กรวิทย์ สุวรรณศิริคำ'),
('54152', 'นครชัย บุญมากทรัพย์'),
('54172', 'จุฑารัตน์ แก้วปัญญา'),
('54190', 'อรรถพงษ์ ปวงย้อยแก้ว'),
('54193', 'ฐณิฌา  บุญมาเมือง'),
('55001', 'ศตายุ สุรินต๊ะ'),
('55004', 'พนิดา จิรศรัณยานนท์'),
('55035', 'ธนยศ กฐินสมมิตร์'),
('55044', 'ทัศนีย์ โรจน์สิงห์'),
('55048', 'ณัฐฐิญา ปิ่นแก้ว'),
('55054', 'ดลกร บุญติ'),
('55059', 'วีรภัทร์ อุทองธีรโรจน์'),
('55089', 'ปิยนันท์ แก้วบังวัน'),
('55108', 'พวงลดา ปัญญาคม'),
('55163', 'ศิริขวัญ ขาวงาม'),
('55174', 'สุพรรณี รักไทย'),
('55176', 'กิตติชัย สถานเดิม'),
('55177', 'SAI CHIT MIN (คิดมิ้น)'),
('55184', 'วสันต์ ศรีมูล'),
('55202', 'ภัทรฤทัย แก้วฝั้น'),
('55207', 'ปกรณ์เกียรติ จันทรากิตติพงษ์'),
('55248', 'คำสุข ระขะไพ'),
('55273', 'อัจฉรา เครือสุข'),
('55282', 'ทิพย์สุดา กันตีมูล'),
('55285', 'พรรณิดา ภูมี'),
('55288', 'ภรณ์ณภัส  ดำสงค์'),
('55290', 'ศักดิ์สิทธิ์ สุวรรณโชติ'),
('55293', 'ณัฎฐ์ชวัญช์  สุวรรณสิทธิ์'),
('55299', 'จาตุรงค์ จันทร์เยี่ยม'),
('56010', 'สุรชัย กันตีมูล'),
('56026', 'กาญจนา ซูดู'),
('56034', 'วนาฬาร ตาเร็ว'),
('56041', 'เก่งติกุล เกิดธารา'),
('56049', 'ปภิญญพัทธ์  อุ่นแก้ว'),
('56056', 'Sai  Phone'),
('56057', 'อภิชญา  เกี๋ยงคำ'),
('56068', 'เบญจวรรณ เหลี่ยมแสง'),
('56069', 'ผุ่น ฉัตรศักดิ์กุล'),
('56103', 'วริฎฐา  ชมภูพื้น'),
('56107', 'กำธร แซ่จิว'),
('56111', 'สมเกียรติ์    จันทร์บ่อแก้ว'),
('56116', 'ไพจิตร พานน้อย'),
('56117', 'อัจฉรา พรดวงคำ'),
('56131', 'อนนันตชัย  สมบัติวงษ์'),
('56151', 'พิชญากร  กันยา'),
('56154', 'ไพรัช  ปัญญาเหล็ก'),
('56158', 'สุกัญญา ธรรมชัย'),
('56163', 'เอกชัย  จันต๊ะไพร'),
('56170', 'พัชรี  ดวงปินตา'),
('56172', 'บรรพต  ยศเครือ'),
('56187', 'นิธิพิชญ์ พรหมอนัต์'),
('56188', 'เปรมสินิ จีนา'),
('56200', 'ปิยะ  ขันธวุธ'),
('56201', 'วุฒิวัฒน์  กันธะ'),
('56231', 'วัชรกรณ์  พุทธิชนม์'),
('56241', 'นิธินาถ  เอมประเสริฐ'),
('56251', 'กิตติกวิน หอมชื่น'),
('56252', 'เอกนรินทร์ ยิ้มเจริญ'),
('56263', 'เกื้อ รักษาโสม'),
('57017', 'กันต์กวิน  ใจปูน'),
('57019', 'วัชราภรณ์  วงศ์กาสี'),
('57025', 'กฤษณพงศ์  รวมสุข'),
('57047', 'ชาคริต  หนุนจันทร์'),
('57051', 'นวภัสร์ พิณตะคุ'),
('57055', 'สราวุธ โรจน์ปาน'),
('57075', 'คเณศ  ชัยอมฤต'),
('57089', 'นคร ทองวฤทธิ์'),
('57090', 'นราดล  กาบทอง'),
('57094', 'ณัฐภพ ไพรสิงห์'),
('57095', 'กิจลักษณ ม่วงมา'),
('57097', 'จักรี  ชีพการุณย์'),
('57099', 'สุรินทร์  คำเมรุ'),
('57114', 'ทัศนีย์  ธรรมชัย'),
('57115', 'สิรินภา  หงษ์ประสิทธิ์'),
('57128', 'เอกพันธ์  อนันคำ'),
('57129', 'วิระวัฒน์  วิเชียรโชติ'),
('57132', 'SAI TUN NAY'),
('57147', 'เพ็ญพักตร์  ลอยเมฆ'),
('57158', 'กิตติพงษ์ ปัญญาเรือง'),
('57161', 'ดำรงค์ วุฒิ'),
('57166', 'กานต์พิชชา  บุญแรง'),
('57182', 'เทวินทร์ ณ เชียงใหม่'),
('57198', 'จรรยา อินวาทย์'),
('57209', 'อรทัย วงศ์อ้าย'),
('57217', 'อังคณา  คุ้มวานิช'),
('57227', 'ทรงพล  มาตระกูล'),
('57233', 'อนุพงษ์  กันทา'),
('57234', 'ระพีพัฒน์  ชัยยา'),
('57248', 'ลดาวัลย์  สมย้อย'),
('57249', 'เทียนชัย  อินต๊ะบุญมา'),
('57256', 'รุ่งนภา  คำนาง'),
('58013', 'วิภาภรณ์  ทิศหล้า'),
('58019', 'สุภาพร  วีรประพันธ์'),
('58022', 'อาทิตย์  ตันประเสริฐ'),
('58027', 'กฤษณะ  แก่นจักร์'),
('58028', 'นิรันดร์  ดวงลังกา'),
('58032', 'ภาคิน  ปัญญาฟู'),
('58033', 'วิภาวรรณ แปงใจ'),
('58039', 'สุพรรณี ใจวงค์ทา'),
('58051', 'Sai Sam Thun (โจ้)'),
('58052', 'กรวีร์  กาพย์ตุ้ม'),
('58058', 'ชนิดา  กันนา'),
('58060', 'เอกฤทธ์  อินทรัชว์'),
('58064', 'สุภาพร   ปัญญาสุข'),
('58067', 'วรยศ  วิลัยวงค์'),
('58068', 'กาญจนา  กลิ่นขจร'),
('58069', 'สุเทพ  พันธ์ทอง'),
('58070', 'ณัฎฐกร  สุจารีย์'),
('58073', 'อนุรักษ์  พงพัง'),
('58083', 'จิรวรรณ  แสนเป็ง'),
('58085', 'วรัชชนัน  อุตมะ'),
('58086', 'เจริญศักดิ์  อุตะระ'),
('58087', 'รัชนี  ชมภู'),
('58100', 'วงศกร  คำบุรี'),
('58105', 'วัชราภรณ์  อินสอน'),
('58106', 'สุวรรณภา  เพ็ชรชนก'),
('58110', 'นุศรา กำแพงแก้ว'),
('58112', 'จริยา  ต๋าคำธรรม'),
('58123', 'วุฒิชัย  เอโหย่'),
('58133', 'วิทยา  วีระชัย'),
('58137', 'เทพมงคล สุยะเรือง'),
('58151', 'เอกวัฒน์  ปิมปา'),
('58160', 'เกียรติศักดิ์ โบแบน'),
('58169', 'รุ่งโรจน์  ยาอุด'),
('58177', 'มัทนา  ชำนาญ'),
('58182', 'จิราภา  เพชรโกศัย'),
('58184', 'อชิตพล  จารุพัฒนะสิริกุล'),
('58186', 'อนุรักษ์  พงพัง'),
('58194', 'ภูริวัฒน์ นันไชยก๋า'),
('58195', 'ภาณุเดช  ไอ่จันทร์'),
('59004', 'ธนายุทธ  พื้นดี'),
('59012', 'สำราญ  นันทานนท์'),
('59013', 'สุพจน์  ต๊ะปวง'),
('59015', 'Saw nay htoo (ตือ)'),
('59016', 'จรรยพร  เค้ามูล'),
('59017', 'สกาวเดือน จันทร์ทัต'),
('59020', 'ชาติชาย  สมพงษ์'),
('59022', 'ปัทมา  เต็มราษี'),
('59025', 'อรรถพล  อุตภิระ'),
('59027', 'ประวิทย์  สุก้นโต'),
('59031', 'พชรพล  กันทายวง'),
('59033', 'สินิตย์  หลีสกุล'),
('59036', 'ชูศักดิ์  ลวนคำ'),
('59037', 'ทองพิพัฒน์  เงินสายตา'),
('59042', 'รุ่งกานต์  บุญมา'),
('59043', 'จุฑามาศ  รัตนวงศ์ศิริ'),
('59047', 'ชาตรี  วีระพันธุ์'),
('59054', 'กนก เสนาโปธิ'),
('59056', 'เทพกร  แก้วก๋า'),
('59062', 'ทรงพล  อินต๊ะวงศ์'),
('59065', 'ทวินันท์  ผลิผล'),
('59068', 'ณัฐพงษ์  ปัญญาวงศ์'),
('59069', 'รัฐภู  หอมหวล'),
('59070', 'พัชรี  พิพิชภักดี'),
('59071', 'สมเกียรติ  รักษ์พนา'),
('59084', 'ณัฐพร  ปัญญา'),
('59087', 'กัญญารัตน์  ฟูสกุล'),
('59089', 'An Htaw Ne (แก้ว)'),
('59092', 'ผุสดี  วงษาลานนา'),
('59094', 'วีรนันท์  อุทัยมงคล'),
('59103', 'เชิดศักดิ์ โลหะกุล'),
('59104', 'นิติพงศ์  ดีดวงแก้ว'),
('59118', 'ชีวนันท์  พันธุ์จันทร์'),
('59120', 'กิตติศักดิ์  เขื่อนคำ'),
('59122', 'นิตยา พุทธวงค์'),
('59123', 'สิริพร  เขื่อนคำ'),
('59126', 'ชูตระกูล  กันทะอินทร์'),
('59128', 'อรทัย  หยกแก้วตระการ'),
('59130', 'ทิพาพร  กล้าหาญ'),
('59135', 'สุวิณี  กล้าณรงค์'),
('59136', 'พรวิมล  ปัญญารัตน์'),
('59139', 'บุปผารัตน์  เทพสุริยะ'),
('59141', 'รัศมี  ประเภทจิตร'),
('59142', 'อภิชาติ  เสนหล้า'),
('59143', 'ไหมแก้ว  ลุงนะ'),
('59145', 'แก้ว  ส่างสี'),
('59149', 'Nan Ying (หญิง)'),
('59151', 'ชาญณรงค์  บุดดี'),
('59154', 'อนุรัตน์  อ่ำกร่าง'),
('59156', 'เอกชัย  ชัยยะสุ'),
('59157', 'ธนิดา  ไชยโย'),
('59158', 'พัชร  จิตรเพียร'),
('59160', 'Nan Lin (ลิน)'),
('59164', 'เมธินทร์ ทองแดง'),
('59168', 'วัชรพงษ์  ตานันท์'),
('59169', 'สหจักรวรรดิ์  สุริยะจักรวาล'),
('59171', 'กรกช  คำปินตา'),
('59173', 'รัตติกาล  ธรรมรังษี'),
('59177', 'จิตราวดี  กาบขาว'),
('59178', 'จิตราวดี  กาบขาว'),
('59180', 'ปิยะพงษ์  ภัทรชัยวรรณ'),
('59181', 'ธนสรรค์  สมการณ์'),
('59182', 'ทรงวุฒิ  มณีวรรณ'),
('59183', 'ภูอาสาห์  อินต๊ะ'),
('59184', 'Sai kyaw min tun (ใหญ่)'),
('59185', 'ปิยกฤช  ศรีดาวเรือง'),
('59188', 'ทิพย์วรรณ  สายเครื่อง'),
('59189', 'Thaung Htike Aung (ยาว)'),
('59194', 'Nan Mwe (หมวย)'),
('59195', 'เฉลิมพันธ์  ธิกันทา'),
('59200', 'ปริศนา  ปฏิมา'),
('59201', 'ธัชชัย  สุวรรณศิริคำ'),
('59204', 'ธวัชชัย  เงินคำจันทร์'),
('59205', 'ทิพธ์สุคนธ์ รอดเครือทอง'),
('59208', 'ณัฐพล  สิริกูลไชยวงศ์'),
('59211', 'ณัฐพร  เชื้อไทย'),
('59212', 'พัชรินทร์  สุริยะ'),
('59213', 'สิทธิกร  ชัยมงคล'),
('59217', 'สุพาวรรณ หลวงอิน'),
('59218', 'วารุณี  ใจคำ'),
('59220', 'จามอู  ลุงเก่ซะ'),
('59222', 'ศุภกิจ  วงศ์สุวรรณ'),
('59226', 'มอน  ลุงต๊ะ'),
('59227', 'เหมยเส็ง  แซ่จ๋าว'),
('60002', 'ศุภชัย  ไชวิทูลย์'),
('60003', 'วรรณิกา บัวคำ'),
('60004', 'พัชริดา แสนสุขอุดมบุญ'),
('60005', 'ช่อผกา มโนวร'),
('60006', 'พีรัช  คำแปง'),
('60008', 'กฤษณา  สายสวาท'),
('60009', 'แสงทิพย์  พรหมตา'),
('60012', 'เชี่ยวชาญ  สายพวงแก้ว'),
('60013', 'ณัฐพงษ์ ตาแก้ว'),
('60016', 'ศิริพงษ์  วงค์ขัติย์'),
('60017', 'อัครพล อยู่สอนธรรม'),
('60020', 'กิตติพงษ์  อาราม'),
('60024', 'ศิริกัญญา ทะยาหมอ'),
('60025', 'อภิชัย  หยกแสงทวีสิน'),
('60026', 'แก้ว  บุญมา'),
('60027', 'สุจิตตรา  วังคำตน'),
('60029', 'ธรรมธรชัย  พุทธิมา'),
('60030', 'ณัฐกานต์  จิระอนุกูลชัย'),
('60032', 'สุรเชษฐ์  เลิศขวัญพนา'),
('60033', 'Nan mue maw(หมวย)'),
('60039', 'อาแสง  แซ่หยาง'),
('60040', 'ปฐมพงษ์  เวชสุวรรณ'),
('60043', 'ช่อผกา  คิดไชย'),
('60044', 'พัชรา  มาลีไพวัลย์'),
('60047', 'ศศิประภา  อิ่นคำ'),
('60048', 'นารี แซ่วะ'),
('60053', 'ศิรินาท  อ่ำทรงงาม'),
('60054', 'ทนุพัทธ  อินทรัตน์'),
('60055', 'สุชาติ  เลิศชัยสหกุล'),
('60057', 'อุไรลักษณ์  ปัญญาสา'),
('60058', 'เพ็ญตา  ไทยหินโจน'),
('60060', 'พิชญา  วงศ์สุวรรณ'),
('60063', 'ธีระพล บุญสิทธิ์'),
('60066', 'จีราวรรณ  คาถา'),
('60067', 'มนัส  ทำกล้า'),
('60068', 'น้ำฝน พงษ์เพชร'),
('60071', 'อ่องคำ ลุงลู'),
('60072', 'ธัญวลัย  ธนัชธีรพัฒน์'),
('60073', 'วลัยภรณ์  ปัญญาฟู'),
('60076', 'ผุสดี  ฝั้นนา'),
('60079', 'บุญญรัตน์  นวลจันทร์'),
('60080', 'จิตพัต สวัสดี'),
('60081', 'มู่คำ  ลุงชู'),
('60082', 'ศิรินทร์ทิพย์  ทาลำปาง'),
('60083', 'ชุลีวัลย์  สุขศรี'),
('60084', 'ธิดาพร  เมืองคำ'),
('60085', 'พิมพ์อร  ปละอุด'),
('60086', 'ธนทรัพย์  จิตร์แก้ว'),
('60087', 'พัชรี  แรงจริง'),
('60088', 'ศรัญญา  คำราพิช'),
('60089', 'อนุชา  มาคำ'),
('60090', 'ณัฐพงศ์  กองตองกาย'),
('60091', 'กฤติพงศ์  วงค์ฝั้น'),
('60095', 'กุลนันทน์  ปานทองคำ'),
('60097', 'ณัฐพล  สุขใจ'),
('60098', 'สาวิตรี  สิทธิกรสกุล'),
('60100', 'ศิรดาวรรณ  ดิษฐ์บ้านไร่'),
('60101', 'ณัฐพร  เชื้อไทย'),
('60103', 'พัชรินทร์ นำโน'),
('60104', 'พลอยไพลิน  กันจินา'),
('60105', 'ปริญญา  พันธ์พฤกษา'),
('60106', 'ศรัณย์  เศษฐะยะ'),
('60107', 'ฟาฟา พิมลเลิศอัมพร'),
('60108', 'รวีโรจน์  ห้ามทุกข์'),
('60109', 'พิสิษฐ์  ศิรินภาพันธ์'),
('60110', 'ลภัสอร  พลพืช'),
('60111', 'มาริษา  เสาวคนธ์'),
('60112', 'ปวีณา  ปุริสพันธ์'),
('60113', 'กัญชญา  นันทศิษฎ์'),
('60114', 'อัมรินท์  วรรณคำ'),
('60115', 'ณัฐพงศ์ กองตองกาย'),
('60116', 'บุญมี พิศไหว'),
('60120', 'อนุรักษ์  สกุณี'),
('60121', 'อรุณรัตน์  คำมา'),
('60122', 'นพพล อันตะริกานนท์'),
('60128', 'ธิดา  พรทิวามงคลชัย'),
('60129', 'จักรี  พงษ์หล้า'),
('60130', 'ภัทรพงศ์  จันต๊ะวารี'),
('60131', 'พรชัย  ชัยยา'),
('60134', 'วิราวรรณ  พุทธเกิด'),
('60135', 'นวภัสร์  น้อยอ้าย'),
('60138', 'ชุติกานต์  สุกัณทะ'),
('60139', 'วรางคณา  หลวงโย'),
('60142', 'ธนากร  กระจ่าง'),
('60143', 'หลู่ ลุงมู'),
('60144', 'สุปราณี  มานะ'),
('60146', 'พงษ์พัฒน์  กะตา'),
('60147', 'วิราวรรณ  พุทธเกิด'),
('60149', 'พิมพ์อรุโณทัย  เรือนออน'),
('60150', 'สมบุญ  จันทร์วงค์'),
('60153', 'เฉลิม  มูลชุมภู'),
('60154', 'ฤทธิพงษ์  ปรารมภ์'),
('60157', 'เอกวัฒน์  ปิมปา'),
('60158', 'ปริวรรษ  ปิยะจันทร์'),
('60159', 'สงกรานต์  มั่งคั่ง'),
('60160', 'แสงคำ'),
('60161', 'Nan jam ohm'),
('60162', 'เต็ง'),
('60163', 'ภูวดล  อินทรศรี'),
('60164', 'ชนินทร์  อินทรศรี'),
('60165', 'ธัญวรัฎน์ สิริพิพัฒน์'),
('60166', 'อรรถพล  มาป้อม'),
('60167', 'สัญปกรณ์ สิริกัน'),
('60168', 'เจริญธรรม  คำเครือ'),
('60169', 'ชไมพร  อุ่นพรม'),
('60170', 'เจษฎา  เจริญองค์'),
('60171', 'โศรยา  พวงเพ็ชร'),
('60172', 'จริยาภรณ์  วินันท์'),
('60173', 'อ่อง  ลุงหลิ่ง'),
('60175', 'ณรงค์ฤทธิ์  พูลคำ'),
('60176', 'กฤติพงศ์  วงค์ฝั้น'),
('60177', 'หนึ่งฤทัย  ศรีวิชัย'),
('60179', 'Sai lao'),
('60180', 'อัคราช  ชุณหภิญโญกุล'),
('60181', 'สิทธิชัย วงศ์ฝั้น'),
('60182', 'ธารทิพย์ เศรษฐกิจ'),
('60183', 'สุทิน  อินต๊ะอ้าย'),
('60184', 'อมฤทธิ์  ทองธิราช'),
('60185', 'อดิเรก  ตั๋นอิ่น'),
('60186', 'พิชิตพงษ์  วงค์ศายะ'),
('60187', 'จีรพัฒน์  ชุมภู'),
('60188', 'วิษณุ  อุปโย'),
('60189', 'รุจิรา  การินทร์ตา'),
('60190', 'ปาริชาติ  วงค์ขัติย์'),
('60191', 'อานนท์  สุวรรณสิทธิ์'),
('60192', 'ยุพยง  ม่วงมา'),
('60195', 'สุทธิพงศ์  กาบแดง'),
('60196', 'นก  ลุงออ'),
('60197', 'เอกสิทธิ์  รุจิฤทธิ์โสฬส'),
('60198', 'นรเศรษฐ  วงศ์ศุภสิน'),
('60199', 'พลวัฒน์  ใจสม'),
('60200', 'สหจักรวรรดิ์  สุริยะจักรวาล'),
('60201', 'พิริยะ  จิระตราชู'),
('60202', 'มัลลิกา  วงค์อิ่น'),
('60203', 'วรัญญา  ขำดี'),
('60204', 'อนุชา  พรหมเทศ'),
('60206', 'ทองอยู่ ลุงนะ'),
('60207', 'กฤตธน คำมงคล'),
('60208', 'สุวัฒน์  ปินะสุ'),
('60209', 'ศุภัทรศรา  เพ็ญศิริ'),
('60210', 'Sai sin(ต้า)'),
('60211', 'มัลลิกา วรรณศรี'),
('60212', 'สุทธวีร์  ใหม่ธรรม'),
('60213', 'อนุพงษ์  หม้อศรีใจ'),
('60214', 'จักรรินทร์  จิตรโอฬาร'),
('60217', 'โสภณ  ศุภภาดล'),
('61001', 'ธนโชติ  คงเมือง'),
('61002', 'สุรเดช  คำอ้าย'),
('61003', 'สถิตย์  จิตตปันตา'),
('61004', 'ศิศิชา  อภิวงค์คำ'),
('61005', 'กิติพงษ์  จันพุธ'),
('61006', 'รุจน์  เทพตระกูล'),
('61007', 'ปรเมศ  แซ่ยะ'),
('61008', 'พรศิวะ  ไชยยา'),
('61009', 'สุธีมนต์  จำกัด'),
('61010', 'พิลาสลักษณ์  ชีวเกรียงไกร'),
('CDG1', 'ทีมเร่งรัด1(พี่เล็ก-เกียรติ)'),
('CDG2', 'ทีมเร่งรัด2(พี่วิ-ผักกาด)');

-- --------------------------------------------------------

--
-- Table structure for table `lend_empsp`
--

CREATE TABLE `lend_empsp` (
  `No` int(12) NOT NULL,
  `rent_empID` char(6) COLLATE utf8_unicode_ci NOT NULL,
  `rent_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `rent_phone` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `rent_date` date NOT NULL,
  `lend_status` tinyint(2) UNSIGNED ZEROFILL NOT NULL DEFAULT '01',
  `rent_department` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `lend_Log` int(1) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `lend_empsp`
--

INSERT INTO `lend_empsp` (`No`, `rent_empID`, `rent_name`, `rent_phone`, `rent_date`, `lend_status`, `rent_department`, `lend_Log`) VALUES
(35, '1234', 'น้องต่าย', '094-636508', '0000-00-00', 01, 'บุคคล', 1),
(36, '987', 'poot', '097-976544', '0000-00-00', 01, 'บุคคล', 1),
(37, '1234', 'น้องต่าย', '094-636508', '0000-00-00', 01, 'บุคคล', 1),
(38, '987', 'poot', '097-976544', '0000-00-00', 01, 'บุคคล', 1),
(39, '1150', 'thantip', '097-976544', '0000-00-00', 01, 'การเงินสินเชื่อ', 1),
(40, '1150', 'thantip', '097-853799', '0000-00-00', 01, 'การเงินสินเชื่อ', 1),
(41, '555500', 'NonGBiG', '0841720778', '0000-00-00', 01, 'ไอที', 1),
(42, '555500', 'NonGBiG', '0841720778', '0000-00-00', 01, 'ไอที', 1),
(43, '555502', 'NonGBiG', '0841720778', '0000-00-00', 01, 'บุคคล', 1);

-- --------------------------------------------------------

--
-- Table structure for table `lend_spare`
--

CREATE TABLE `lend_spare` (
  `No` int(11) NOT NULL,
  `id_spare` tinyint(3) UNSIGNED ZEROFILL NOT NULL,
  `name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `detail` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `category_lend` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `amount` int(11) NOT NULL,
  `Order_lend` int(11) NOT NULL,
  `lend_data` date NOT NULL,
  `rent_empID` char(6) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `lend_spare`
--

INSERT INTO `lend_spare` (`No`, `id_spare`, `name`, `detail`, `category_lend`, `amount`, `Order_lend`, `lend_data`, `rent_empID`) VALUES
(2, 002, 'สายแลน', 'amp', '03', 3, 35, '0000-00-00', '1234'),
(3, 004, 'ASD', 'X1', '02', 2, 36, '0000-00-00', '987'),
(4, 015, 'XXR', 'amp', '01', 3, 36, '0000-00-00', '987'),
(5, 002, 'สายแลน', 'amp', '03', 1, 37, '0000-00-00', '987'),
(6, 002, 'สายแลน', 'amp', '03', 4, 39, '0000-00-00', '1150'),
(7, 002, 'สายแลน', 'amp', '03', 2, 40, '0000-00-00', '1150'),
(8, 003, 'เม้าส์', ' Gaming G300S  ', ' 02', 1, 40, '0000-00-00', '1150'),
(9, 001, 'คีบอร์ด', 'X1', '01', 2, 41, '0000-00-00', '555500'),
(10, 002, 'สายแลน', 'amp', '03', 2, 41, '0000-00-00', '555500'),
(11, 001, 'คีบอร์ด', 'X1', '01', 2, 42, '0000-00-00', '555500'),
(12, 002, 'สายแลน', 'amp', '03', 2, 42, '0000-00-00', '555500'),
(13, 005, 'sdf', 'X1', '00', 2, 43, '0000-00-00', '555502'),
(14, 002, 'สายแลน', 'amp', '03', 2, 43, '0000-00-00', '555502'),
(15, 004, 'ASD', 'X1', '02', 2, 43, '0000-00-00', '555502');

-- --------------------------------------------------------

--
-- Table structure for table `rent`
--

CREATE TABLE `rent` (
  `Rent_id` int(11) NOT NULL,
  `Rent_asset` char(12) COLLATE utf8_unicode_ci NOT NULL,
  `Rent_emp` char(5) COLLATE utf8_unicode_ci NOT NULL,
  `Rent_active` tinyint(3) UNSIGNED ZEROFILL NOT NULL,
  `Rent_time` date NOT NULL,
  `Rent_ect` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `Rent_log` int(1) NOT NULL DEFAULT '1',
  `remand` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `rent`
--

INSERT INTO `rent` (`Rent_id`, `Rent_asset`, `Rent_emp`, `Rent_active`, `Rent_time`, `Rent_ect`, `Rent_log`, `remand`) VALUES
(56, '0008', 'YPEER', 003, '2018-01-19', 'ทดสอบ List จุดใช้งาน', 0, '2018-01-19 01:48:17'),
(55, '0003', 'YPEER', 006, '2018-01-17', '654123', 0, '2018-01-31 07:33:54'),
(59, '0002', 'YPEER', 001, '2018-02-02', '55', 0, '2018-02-02 03:06:17'),
(53, '0002', 'E2121', 001, '2018-01-17', '', 0, '2018-01-31 07:48:22'),
(49, '0001', 'YPEER', 006, '2017-12-10', 'teastqq', 0, '2018-02-01 10:27:21'),
(50, '0001', 'T3333', 001, '2017-12-10', '123', 0, '2018-01-31 07:56:20'),
(51, '0001', 'YPEER', 006, '2017-12-11', 'ทดสอบๆ', 0, '2018-01-20 02:39:31'),
(52, '0002', 'YPEER', 002, '2018-01-16', '55555', 0, '2018-01-16 09:51:47'),
(57, '0008', 'YPEER', 003, '2018-01-20', 'ทดสอบการวนลูป', 0, '2018-01-31 07:56:19'),
(58, '0002', 'YPEER', 001, '2018-01-22', '987456321', 0, '2018-01-31 07:56:17'),
(60, '0002', 'YPEER', 001, '2018-02-02', '', 0, '2018-02-02 09:12:20');

-- --------------------------------------------------------

--
-- Table structure for table `send_sp`
--

CREATE TABLE `send_sp` (
  `send_id` tinyint(2) NOT NULL,
  `send_bill` int(2) NOT NULL,
  `send_idSp` tinyint(3) UNSIGNED ZEROFILL NOT NULL,
  `send_nameSp` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `send_brand` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `send_number` int(1) NOT NULL,
  `send_back` int(2) NOT NULL,
  `send_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `send_department` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `send_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `send_sp`
--

INSERT INTO `send_sp` (`send_id`, `send_bill`, `send_idSp`, `send_nameSp`, `send_brand`, `send_number`, `send_back`, `send_name`, `send_department`, `send_date`) VALUES
(1, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(2, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(3, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(4, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(5, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(6, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(7, 35, 002, 'สายแลน', '', 3, 1, '', '', '0000-00-00'),
(8, 41, 006, 'กระต่าย', '11111', 1, 0, '', '', '0000-00-00'),
(9, 35, 002, 'สายแลน', 'amp', 3, 2, '', '', '0000-00-00'),
(10, 41, 006, 'กระต่าย', '11111', 1, 0, '', '', '0000-00-00'),
(11, 39, 002, 'สายแลน', 'amp', 4, 1, '', '', '0000-00-00'),
(12, 35, 002, 'สายแลน', 'amp', 3, 2, '', '', '0000-00-00'),
(13, 35, 002, 'สายแลน', 'amp', 3, 2, '', '', '2018-01-18'),
(14, 43, 002, 'สายแลน', 'amp', 1, 2, '', '', '0000-00-00'),
(15, 54, 006, 'กระต่าย', '11111', 1, 1, '', '', '0000-00-00'),
(16, 45, 002, 'สายแลน', 'amp', 1, 0, '', '', '0000-00-00'),
(17, 60, 019, 'คีบอร์ดด', '111111111111', 1, 1, '', '', '0000-00-00');

-- --------------------------------------------------------

--
-- Table structure for table `spare_part`
--

CREATE TABLE `spare_part` (
  `id` tinyint(2) UNSIGNED ZEROFILL NOT NULL,
  `photo` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `brand` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `price` decimal(8,2) NOT NULL,
  `category` tinyint(2) UNSIGNED ZEROFILL NOT NULL,
  `stock` int(2) NOT NULL,
  `acquire` tinyint(1) NOT NULL,
  ` Pay` tinyint(1) NOT NULL,
  `balance` tinyint(3) NOT NULL,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `spare_part`
--

INSERT INTO `spare_part` (`id`, `photo`, `name`, `brand`, `price`, `category`, `stock`, `acquire`, ` Pay`, `balance`, `time`) VALUES
(01, 'keyboard.png', 'คีบอร์ด', 'X1', '500.00', 01, 3, 1, 0, 5, '2017-12-14 01:48:10'),
(02, 'network wired.png', 'สายแลน', 'amp', '150.00', 03, 6, 5, 0, 6, '2018-01-11 04:28:06'),
(03, 'if_mouse.png', 'เม้าส์', ' Gaming G300S  ', '530.00', 01, 1, 5, 0, 5, '2018-01-11 04:28:04'),
(04, 'if_usb_disk.png', 'ASD', 'X1', '333.00', 02, 2, 5, 0, 2, '2017-12-14 01:50:11'),
(05, 'if_RAM.png', 'sdf', 'X1', '200.00', 00, 3, 1, 0, 3, '2018-01-11 04:28:00'),
(06, 'if_My Computer.png', 'กระต่าย', '111111111111', '500.00', 03, 5, 5, 0, 0, '2017-12-14 01:50:37'),
(68, 'if_vector.png', 'Ram', 'Susi', '500.00', 02, 2, 1, 0, 0, '2018-01-11 04:27:58');

-- --------------------------------------------------------

--
-- Table structure for table `status`
--

CREATE TABLE `status` (
  `Status_id` tinyint(2) UNSIGNED ZEROFILL NOT NULL,
  `Status_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `Status_log` int(1) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `status`
--

INSERT INTO `status` (`Status_id`, `Status_name`, `Status_log`) VALUES
(01, 'พร้อมใช้งาน', 1),
(02, 'เสีย', 1),
(03, 'รอซ่อม', 1),
(04, 'ยืม', 1),
(06, 'ยังไม่ครบ', 1);

-- --------------------------------------------------------

--
-- Table structure for table `take`
--

CREATE TABLE `take` (
  `take_id` tinyint(4) UNSIGNED ZEROFILL NOT NULL,
  `id_inventory` tinyint(2) UNSIGNED ZEROFILL NOT NULL,
  `take_name` varchar(200) COLLATE utf8_unicode_ci NOT NULL,
  `take_brand` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `take_pice` decimal(8,2) NOT NULL,
  `take_category` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `take_acquire` tinyint(1) NOT NULL,
  `take_time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `take`
--

INSERT INTO `take` (`take_id`, `id_inventory`, `take_name`, `take_brand`, `take_pice`, `take_category`, `take_acquire`, `take_time`) VALUES
(0056, 00, ' ', '', '0.00', '1', 1, '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `Username` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `Password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `Level` varchar(20) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`Username`, `Password`, `Level`) VALUES
('57541204144-5', '1234', 'Student'),
('5901030205259', '12345 ', 'Student'),
('5901080906144', '1234', 'Student'),
('5901100207011', '1234', 'Student'),
('5901100506442', '1234', 'Student'),
('5901130710311', '1234', 'Student'),
('5901140201260', '1234', 'Student'),
('5902010608305', '1234', 'Student'),
('5902020302466', '1234', 'Student'),
('5902030509034', '1234', 'Student'),
('5902040905064', '1234', 'Student'),
('5902050501482', '1234', 'Student'),
('5902070805029', '1234', 'Student'),
('5902170204309', '1234', 'Student'),
('5903020906414', '1234', 'Student'),
('5903030303460', '1234', 'Student'),
('5903040202203', '1234', 'Student'),
('5903070807105', '1234', 'Student'),
('5903090603303', '1234', 'Student'),
('5903100204078', '1234', 'Student'),
('5903101006361', '1234', 'Student'),
('5903110404303', '1234', 'Student'),
('5903150906496', '1234', 'Student'),
('5903180208390', '1234', 'Student'),
('5903180901321', '1234', 'Student'),
('5904010410157', '1234', 'Student'),
('5904090706038', '1234', 'Student'),
('5904090808264', '1234', 'Student'),
('5904111003077', '1234', 'Student'),
('5904160106258', '1234', 'Student'),
('5905040304459', '1234', 'Student'),
('5905110608243', '1234', 'Student'),
('5905180802492', '1234', 'Student'),
('5906030210360', '1234', 'Student'),
('5906070501100', '1234', 'Student'),
('5906070803424', '1234', 'Student'),
('5906100205470', '1234', 'Student'),
('5906110303497', '1234', 'Student'),
('5906110709473', '1234', 'Student'),
('5906120802223', '1234', 'Student'),
('5906150707329', '1234', 'Student'),
('5906160403065', '1234', 'Student'),
('5907050205136', '1234', 'Student'),
('5907050210280', '1234', 'Student'),
('5907090102383', '1234', 'Student'),
('5907090105119', '1234', 'Student'),
('5907121002454', '1234', 'Student'),
('5907140805448', '1234', 'Student'),
('5907140905176', '1234', 'Student'),
('5908010901174', '1234', 'Student'),
('5908030305371', '1234', 'Student'),
('5908030401056', '1234', 'Student'),
('5908040309473', '1234', 'Student'),
('5908070501063', '1234', 'Student'),
('5908090306022', '1234', 'Student'),
('5908090903500', '1234', 'Student'),
('5908090909140', '1234', 'Student'),
('5908101006363', '1234', 'Student'),
('5908110804222', '1234', 'Student'),
('5908130501160', '1234', 'Student'),
('5908170802110', '1234', 'Student'),
('5909010407425', '1234', 'Student'),
('5909020906262', '1234', 'Student'),
('5909060304180', '1234', 'Student'),
('5909060402478', '1234', 'Student'),
('5909060806334', '1234', 'Student'),
('5909070501160', '1234', 'Student'),
('5909110604302', '1234', 'Student'),
('5909150306140', '1234', 'Student'),
('5909151009014', '1234', 'Student'),
('5910020602025', '1234', 'Student'),
('5910060702460', '1234', 'Student'),
('5910060805106', '1234', 'Student'),
('5910090508278', '1234', 'Student'),
('5910090909367', '1234', 'Student'),
('5910100309138', '1234', 'Student'),
('5910130410035', '1234', 'Student'),
('5910171006459', '1234', 'Student'),
('5911020808147', '1234', 'Student'),
('5911051003442', '1234', 'Student'),
('5911080709443', '1234', 'Student'),
('5911100606275', '1234', 'Student'),
('5911110601237', '1234', 'Student'),
('5911120203423', '1234', 'Student'),
('5912060509390', '1234', 'Student'),
('5912110208022', '1234', 'Student'),
('5912120110392', '1234', 'Student'),
('5912160207487', '1234', 'Student'),
('5912160208050', '1234', 'Student'),
('5912170707048', '1234', 'Student'),
('5913010108191', '1234', 'Student'),
('5913020704228', '1234', 'Student'),
('5913020706320', '1234', 'Student'),
('5913060108083', '1234', 'Student'),
('5913070508034', '1234', 'Student'),
('5913080106040', '1234', 'Student'),
('5913080203087', '1234', 'Student'),
('5913180303367', '1234', 'Student'),
('5914010205221', '1234', 'Student'),
('5914020206174', '1234', 'Student'),
('5914020308497', '1234', 'Student'),
('5914020901421', '1234', 'Student'),
('5914050803490', '1234', 'Student'),
('5914051007006', '1234', 'Student'),
('5914090508305', '1234', 'Student'),
('5914110801193', '1234', 'Student'),
('5914120910128', '1234', 'Student'),
('5914130404464', '1234', 'Student'),
('5914160910108', '1234', 'Student'),
('5914170209001', '1234', 'Student'),
('5914170908455', '1234', 'Student'),
('5915020502494', '1234', 'Student'),
('5915040207301', '1234', 'Student'),
('5915070405389', '1234', 'Student'),
('5915081001463', '1234', 'Student'),
('5915110102013', '1234', 'Student'),
('5915140208205', '1234', 'Student'),
('5915160708116', '1234', 'Student'),
('5916010706126', '1234', 'Student'),
('5916020505293', '1234', 'Student'),
('5916060706397', '1234', 'Student'),
('5916080105429', '1234', 'Student'),
('5916080907228', '1234', 'Student'),
('5916090403033', '1234', 'Student'),
('5916090404120', '1234', 'Student'),
('5916110902364', '1234', 'Student'),
('5916150305389', '1234', 'Student'),
('5916170304080', '1234', 'Student'),
('5917020405301', '1234', 'Student'),
('5917051002002', '1234', 'Student'),
('5917100610179', '1234', 'Student'),
('5917101010011', '1234', 'Student'),
('5917140104367', '1234', 'Student'),
('5917150605254', '1234', 'Student'),
('5917180605370', '1234', 'Student'),
('5917180607260', '1234', 'Student'),
('5918050101280', '1234', 'Student'),
('5918060109201', '1234', 'Student'),
('5918090909436', '1234', 'Student'),
('5918130302162', '1234', 'Student'),
('5918140906283', '1234', 'Student'),
('5918150607107', '1234', 'Student'),
('5918150903110', '1234', 'Student'),
('5918150908426', '1234', 'Student'),
('5918151004236', '1234', 'Student'),
('5918161005327', '1234', 'Student'),
('5918170101187', '1234', 'Student'),
('admin', '1234', 'Admin'),
('bigm', '1150', 'Admin'),
('Chile', '1234', 'Teacher'),
('teacher', '1234', 'Teacher');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `No` int(11) NOT NULL,
  `first_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `last_name` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `user_image` int(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `active_point`
--
ALTER TABLE `active_point`
  ADD PRIMARY KEY (`Active_id`);

--
-- Indexes for table `asset`
--
ALTER TABLE `asset`
  ADD PRIMARY KEY (`Asset_id`);

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`Category_id`);

--
-- Indexes for table `category_spare`
--
ALTER TABLE `category_spare`
  ADD PRIMARY KEY (`Category_id`);

--
-- Indexes for table `customer`
--
ALTER TABLE `customer`
  ADD PRIMARY KEY (`CustomerID`);

--
-- Indexes for table `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`Emp_id`);

--
-- Indexes for table `lend_empsp`
--
ALTER TABLE `lend_empsp`
  ADD PRIMARY KEY (`No`);

--
-- Indexes for table `lend_spare`
--
ALTER TABLE `lend_spare`
  ADD PRIMARY KEY (`No`);

--
-- Indexes for table `rent`
--
ALTER TABLE `rent`
  ADD PRIMARY KEY (`Rent_id`);

--
-- Indexes for table `send_sp`
--
ALTER TABLE `send_sp`
  ADD PRIMARY KEY (`send_id`);

--
-- Indexes for table `spare_part`
--
ALTER TABLE `spare_part`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `status`
--
ALTER TABLE `status`
  ADD PRIMARY KEY (`Status_id`);

--
-- Indexes for table `take`
--
ALTER TABLE `take`
  ADD PRIMARY KEY (`take_id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`Username`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`No`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `active_point`
--
ALTER TABLE `active_point`
  MODIFY `Active_id` tinyint(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `asset`
--
ALTER TABLE `asset`
  MODIFY `Asset_id` tinyint(4) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `Category_id` tinyint(3) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `lend_empsp`
--
ALTER TABLE `lend_empsp`
  MODIFY `No` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT for table `lend_spare`
--
ALTER TABLE `lend_spare`
  MODIFY `No` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `rent`
--
ALTER TABLE `rent`
  MODIFY `Rent_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT for table `send_sp`
--
ALTER TABLE `send_sp`
  MODIFY `send_id` tinyint(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `spare_part`
--
ALTER TABLE `spare_part`
  MODIFY `id` tinyint(2) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `status`
--
ALTER TABLE `status`
  MODIFY `Status_id` tinyint(2) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `take`
--
ALTER TABLE `take`
  MODIFY `take_id` tinyint(4) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `No` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
